# Pyspark DataFrame API

## Contents

1 - DataFrame.show()
2 - StructType & StructField & Schema
3 - Column Operators

1 - alias(*alias, *kwargs)
2 - when(condition, value) / otherwise(value)
3 - between(lowerBound, upperBound)
4 - contains()
5 - startswith() / endswith()
6 - isNotNull() / isNull()
7 - isin(*cols)
8 - like()
9 - asc() & desc() – Sort()
10 - cast() & astype()
11 - between() 
12 - contains()
13 - startswith() & endswith()
14 - isNull & isNotNull()
15 - like() & rlike()
16 - when() & otherwise()
17 - isin()
18 - Where() - Filter()
19 - na.drop()
20 - Collect()
21 - select()
22 - describe()
23 - withColumn()
24 - lit()
25 - withColumnRenamed()
26 - drop()
27 - distinct() / dropDuplicates()
28 - orderBy() and sort()
29 - groupBy()
        1-count()  
        2-mean()  
        3-max()
        4-min()
        5-sum()
        6-avg()
30 - agg()
5 - Join Types | Join Two DataFrames
6 - Union()

# Import Libraries

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql import functions as f
from pyspark.sql.functions import *

# Build SparkSession

In [2]:
spark = SparkSession.builder \
.master("local[*]") \
.appName("ml") \
.config("spark.executor.memory","8g") \
.config("spark.driver.memory","8g") \
.getOrCreate()

# Create DataFrame

In [3]:
adult_train_df = spark.read \
.option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.csv("/home/jovyan/work/archive/adult/adult.data")

## .show()
PySpark DataFrame show() is used to display the contents of the DataFrame in a Table Row & Column Format. By default, it shows only 20 Rows, and the column values are truncated at 20 characters.

In [4]:
adult_train_df.show(4)

+---+-----------------+--------+----------+-------------+-------------------+------------------+--------------+------+-----+------------+------------+--------------+--------------+------+
|age|        workclass|  fnlwgt| education|education_num|     marital_status|        occupation|  relationship|  race|  sex|capital_gain|capital_loss|hours_per_week|native_country|output|
+---+-----------------+--------+----------+-------------+-------------------+------------------+--------------+------+-----+------------+------------+--------------+--------------+------+
| 39|        State-gov| 77516.0| Bachelors|         13.0|      Never-married|      Adm-clerical| Not-in-family| White| Male|      2174.0|         0.0|          40.0| United-States| <=50K|
| 50| Self-emp-not-inc| 83311.0| Bachelors|         13.0| Married-civ-spouse|   Exec-managerial|       Husband| White| Male|         0.0|         0.0|          13.0| United-States| <=50K|
| 38|          Private|215646.0|   HS-grad|          9.0|           Divorced| Handlers-cleaners| Not-in-family| White| Male|         0.0|         0.0|          40.0| United-States| <=50K|
| 53|          Private|234721.0|      11th|          7.0| Married-civ-spouse| Handlers-cleaners|       Husband| Black| Male|         0.0|         0.0|          40.0| United-States| <=50K|
+---+-----------------+--------+----------+-------------+-------------------+------------------+--------------+------+-----+------------+------------+--------------+--------------+------+
only showing top 4 rows

## .toPandas() & .limit()
PySpark DataFrame provides a method toPandas() to convert it Python Pandas DataFrame.

toPandas() results in the collection of all records in the PySpark DataFrame to the driver program and should be done on a small subset of the data. running on larger dataset’s results in memory error and crashes the application.

In [5]:
adult_train_df.limit(4).toPandas()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,output
0,39,State-gov,77516.0,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,83311.0,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K
2,38,Private,215646.0,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K
3,53,Private,234721.0,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K

## .columns
To get dataframe columns's names in a list

In [6]:
adult_train_df.columns

['age',
 'workclass',
 'fnlwgt',
 'education',
 'education_num',
 'marital_status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'capital_gain',
 'capital_loss',
 'hours_per_week',
 'native_country',
 'output']

## .printSchema()
To look at dataframe's schema

In [7]:
adult_train_df.printSchema()

root
 |-- age: integer (nullable = true)
 |-- workclass: string (nullable = true)
 |-- fnlwgt: double (nullable = true)
 |-- education: string (nullable = true)
 |-- education_num: double (nullable = true)
 |-- marital_status: string (nullable = true)
 |-- occupation: string (nullable = true)
 |-- relationship: string (nullable = true)
 |-- race: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- capital_gain: double (nullable = true)
 |-- capital_loss: double (nullable = true)
 |-- hours_per_week: double (nullable = true)
 |-- native_country: string (nullable = true)
 |-- output: string (nullable = true)

## Define dataframe's schema

In [8]:
schema="age INT, workclass STRING, fnlwgt DOUBLE, education STRING, education_num DOUBLE, marital_status STRING, occupation STRING, relationship STRING, race STRING, sex STRING, capital_gain DOUBLE, capital_loss DOUBLE, hours_per_week DOUBLE, native_country STRING, output STRING"
#schema="polarity FLOAT, id LONG, date_time STRING, query STRING, user STRING, text STRING"

In [9]:
adult_test_df = spark.read.csv(
        path="/home/jovyan/work/archive/adult/adult.test",
        sep=",",
        header=True,
        quote='"',
        schema=schema)

## .select()
We use the .select() function to select the column we want.

In [10]:
#from pyspark.sql.functions import col
#df.select(col("gender")).show()
#df.select(df["relationship"]).show()
adult_test_df.select(adult_test_df.relationship).show(5)

+------------+
|relationship|
+------------+
|   Own-child|
|     Husband|
|     Husband|
|     Husband|
|   Own-child|
+------------+
only showing top 5 rows

In [58]:
adult_test_df.select(adult_test_df.columns[2:5]).show(3)

+--------+-----------+-------------+
|  fnlwgt|  education|education_num|
+--------+-----------+-------------+
|226802.0|       11th|          7.0|
| 89814.0|    HS-grad|          9.0|
|336951.0| Assoc-acdm|         12.0|
+--------+-----------+-------------+
only showing top 3 rows

## .describe()

In [71]:
# Descriptive Statistic
adult_test_df.describe(["age", "fnlwgt", "education_num", "capital_gain", 
                         "capital_loss", "hours_per_week"]).toPandas()

,summary,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
0,count,16281,16281,16281,16281,16281,16281
1,mean,38.76745900128985,189435.6777839199,10.07290706959032,1081.9051041090843,87.89926908666544,40.392236349118605
2,stddev,13.849186814264337,105714.90767083282,2.567545258667684,7583.935967887075,403.10528562931256,12.479332247112266
3,min,17,13492.0,1.0,0.0,0.0,1.0
4,max,90,1490400.0,16.0,99999.0,3770.0,99.0

## Column Operators

In [11]:
#df.select(df.col1 + df.col2).show()
#df.select(df.col1 * df.col2).show()
#df.select(df.col1 / df.col2).show()
#df.select(df.col1 % df.col2).show()
#df.select(df.col2 > df.col3).show()
#df.select(df.col2 < df.col3).show()
#df.select(df.col2 == df.col3).show()
adult_test_df.select( adult_test_df.hours_per_week - adult_test_df.education_num).show(5)

+--------------------------------+
|(hours_per_week - education_num)|
+--------------------------------+
|                            33.0|
|                            41.0|
|                            28.0|
|                            30.0|
|                            20.0|
+--------------------------------+
only showing top 5 rows

## .sort() & orderBy()
Sort the DataFrame columns by Ascending or Descending order.

In [12]:
# adult_test_df.select("age").orderBy(adult_test_df.age.desc()).show(5)
adult_test_df.select("age").sort(adult_test_df.age.desc()).show(5)

+---+
|age|
+---+
| 90|
| 90|
| 90|
| 90|
| 90|
+---+
only showing top 5 rows

## .cast() & astype()
To convert the data Type

In [13]:
adult_test_df.select(adult_test_df.capital_gain.cast("int")).printSchema()

root
 |-- capital_gain: integer (nullable = true)

## .union()
Dataframe union() – union() method of the DataFrame is used to combine two DataFrame’s of the same structure/schema. If schemas are not the same it returns an error.

In [18]:
adult_whole_df = adult_train_df.union(adult_test_df)

## withColumn()
withColumn() is a transformation function of DataFrame which is used to change the value, convert the datatype of an existing column, create a new column, and many more.

In [235]:
adult_whole_df.withColumn("capital_loss_multiply",col("capital_loss")*100).show(4)

TypeError: 'str' object is not callable

## .trim()
PySpark you can remove whitespaces or trim by using pyspark.sql.functions.trim() SQL functions.

In [19]:
adult_whole_df = adult_whole_df \
.withColumn("workclass", f.trim(f.col("workclass"))) \
.withColumn("education", f.trim(f.col("education"))) \
.withColumn("marital_status", f.trim(f.col("marital_status"))) \
.withColumn("occupation", f.trim(f.col("occupation"))) \
.withColumn("relationship", f.trim(f.col("relationship"))) \
.withColumn("race", f.trim(f.col("race"))) \
.withColumn("sex", f.trim(f.col("sex"))) \
.withColumn("native_country", f.trim(f.col("native_country"))) \
.withColumn("output", f.trim(f.col("output")))

## Where & Filter
filter() function is used to filter the rows from DataFrame based on the given condition or SQL expression, you can also use where() clause instead of the filter() if you are coming from an SQL background, both these functions operate exactly the same.

In [44]:
adult_whole_df.filter(adult_whole_df.race != "White") \
.select("race") \
.show(5,truncate=False)

+------------------+
|race              |
+------------------+
|Black             |
|Black             |
|Black             |
|Black             |
|Asian-Pac-Islander|
+------------------+
only showing top 5 rows

In [52]:
adult_whole_df.filter(~((adult_whole_df.marital_status  == "Never-married") 
                      & (adult_whole_df.sex  == "Male") 
                      & (adult_whole_df.relationship == "Not-in-family") 
                      & (adult_whole_df.hours_per_week >= 50.0) 
                      | (adult_whole_df.age <= 40))) \
.limit(5).toPandas()

,age,workclass,fnlwgt,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,output,education_merged,marital_status_merged
0,50,Self-emp-not-inc,83311.0,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K,Under-Education,Married
1,53,Private,234721.0,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K,High-School,Married
2,49,Private,160187.0,5.0,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0.0,0.0,16.0,Jamaica,<=50K,High-School,Married
3,52,Self-emp-not-inc,209642.0,9.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,45.0,United-States,>50K,HS-grad,Married
4,42,Private,159449.0,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178.0,0.0,40.0,United-States,>50K,Under-Education,Married

## .like()

In [55]:
adult_whole_df.select(adult_whole_df.workclass) \
  .filter(adult_whole_df.workclass.like("%va%")).show(5)

+---------+
|workclass|
+---------+
|  Private|
|  Private|
|  Private|
|  Private|
|  Private|
+---------+
only showing top 5 rows

## .isNull & .isNotNull() 
Checks if the DataFrame column has NULL or non NULL values.

In [56]:
#adult_test_df.filter(adult_test_df.occupation.isNull()).show()
adult_whole_df.filter(adult_whole_df.occupation.isNotNull()).limit(5).toPandas()

,age,workclass,fnlwgt,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,output,education_merged,marital_status_merged
0,39,State-gov,77516.0,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K,Under-Education,Single
1,50,Self-emp-not-inc,83311.0,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K,Under-Education,Married
2,38,Private,215646.0,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K,HS-grad,Single
3,53,Private,234721.0,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K,High-School,Married
4,28,Private,338409.0,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K,Under-Education,Married

## .contains()
Checks if a DataFrame column value contains a a value specified in this function.

In [54]:
adult_whole_df.select("marital_status").filter(adult_whole_df.marital_status.contains("Divorced")).show(5)

+--------------+
|marital_status|
+--------------+
|      Divorced|
|      Divorced|
|      Divorced|
|      Divorced|
|      Divorced|
+--------------+
only showing top 5 rows

## .between()
Returns a Boolean expression when a column values in between lower and upper bound.

In [14]:
adult_whole_df.select("age").filter(adult_test_df.age.between(60,65)).show(5)

+---+
|age|
+---+
| 63|
| 65|
| 65|
| 65|
| 63|
+---+
only showing top 5 rows

## .isin()
Check if value presents in a List.

In [20]:
other=["Other","Amer-Indian-Eskimo", "Asian-Pac-Islander"]
adult_whole_df.select(adult_whole_df.race) \
  .filter(adult_whole_df.race.isin(other)) \
  .show(5)

+------------------+
|              race|
+------------------+
|Asian-Pac-Islander|
|Asian-Pac-Islander|
|Amer-Indian-Eskimo|
|Asian-Pac-Islander|
|             Other|
+------------------+
only showing top 5 rows

## . groupBy()
Similar to SQL GROUP BY clause, 
groupBy() function is used to collect the identical data into groups on DataFrame 
and perform aggregate functions on the grouped data.

In [21]:
adult_whole_df.groupBy(f.col("marital_status")).agg({"*":"count"}) \
.toPandas()

          marital_status  count(1)
0              Separated      1530
1          Never-married     16117
2  Married-spouse-absent       628
3               Divorced      6633
4                Widowed      1518
5      Married-AF-spouse        37
6     Married-civ-spouse     22379

In [192]:
adult_whole_df.groupBy(f.col("workclass")).agg({"*":"count"}) \
.toPandas()

          workclass  count(1)
0  Self-emp-not-inc      3862
1         Local-gov      3136
2         State-gov      1981
3           Private     33906
4       Without-pay        21
5       Federal-gov      1432
6      Never-worked        10
7                 ?      2799
8      Self-emp-inc      1695

In [ ]:
train_df[["Sex", "Survived"]].groupby(["Sex"], as_index=False).mean().sort_values(by = "Survived", ascending=False)
train_df[["SibSp", "Survived"]].groupby(["SibSp"], as_index=False).mean().sort_values(by = "Survived", ascending=False)

In [ ]:
adult_whole_df.filter(adult_whole_df.race != "White").count()

In [202]:
def get_columns_which_have_sought_value(dataframe:dataframe.DataFrame, 
                                        sought_value:object): 
    list_of_cols = []
    for col in dataframe.columns:
        if dataframe.filter(f.col(col).contains(sought_value)).count() > 0:
            list_of_cols.append(col)
    return list_of_cols

In [205]:
cols = show_columns_which_have_question_values(adult_whole_df)
cols

['workclass', 'occupation', 'native_country']

In [256]:
def change_values_in_columns(dataframe:dataframe.DataFrame, 
                             columns:list[str], 
                             value_to_change:object, 
                             value_to_assign=None):
    new_dataframe = dataframe
    for col in columns:
        new_dataframe = new_dataframe \
        .withColumn(col, f.regexp_replace(f.col(col), value_to_change, value_to_assign))
    return new_dataframe

AttributeError: 'DataFrame' object has no attribute 'DataFrame'

In [243]:
for col in cols:
    print(col)

workclass
occupation
native_country

In [254]:
df = change_values_in_columns(adult_whole_df, cols, '?')

NameError: name 'change_values_in_columns' is not defined

In [212]:
#adult_whole_df11 = adult_whole_df.withColumn(col, regexp_replace(f.col(col), '?', "None"))

In [241]:
adult_whole_df13 = adult_whole_df \
.withColumn('workclass', f.regexp_replace(f.col('workclass'), '?', None))

In [249]:
adult_whole_df14.filter(f.col('occupation').contains("?")).count()

2809

In [240]:
adult_whole_df.filter(f.col('workclass').contains("?")).count()

2799

In [22]:
adult_whole_df.groupBy("workclass").sum("hours_per_week").show(truncate=False)

+----------------+-------------------+
|workclass       |sum(hours_per_week)|
+----------------+-------------------+
|Self-emp-not-inc|171454.0           |
|Local-gov       |128097.0           |
|State-gov       |77439.0            |
|Private         |1365501.0          |
|Without-pay     |713.0              |
|Federal-gov     |59447.0            |
|Never-worked    |289.0              |
|?               |89043.0            |
|Self-emp-inc    |82327.0            |
+----------------+-------------------+

In [23]:
adult_whole_df.groupBy("workclass","marital_status") \
    .avg("hours_per_week","age").show(10)

+------------+--------------------+-------------------+------------------+
|   workclass|      marital_status|avg(hours_per_week)|          avg(age)|
+------------+--------------------+-------------------+------------------+
|   Local-gov|Married-spouse-ab...|  40.27272727272727| 39.63636363636363|
| Federal-gov|       Never-married|  39.80978260869565| 33.91032608695652|
|   State-gov|           Separated| 37.784615384615385| 40.43076923076923|
|Self-emp-inc|             Widowed|   41.8780487804878|  62.5609756097561|
| Without-pay|  Married-civ-spouse|  36.76923076923077| 56.38461538461539|
|     Private|             Widowed|  34.49215246636771|57.393497757847534|
|   Local-gov|       Never-married| 38.830827067669176|31.852130325814535|
|Self-emp-inc|            Divorced|  50.31506849315068|46.157534246575345|
| Without-pay|             Widowed|               50.0|              65.0|
|           ?|       Never-married| 32.294736842105266|23.799190283400808|
+------------+--------------------+-------------------+------------------+
only showing top 10 rows

In [24]:
adult_whole_df.groupBy("race") \
    .agg(sum("capital_gain").alias("sum_capital_gain"), \
         avg("hours_per_week").alias("avg_hours"), \
         min("education_num").alias("min_education_num"), \
         max("age").alias("max_age"), \
         avg("age").alias("avg_age"),
         stddev("capital_gain")
     ).where(col("avg_age")<=38) \
    .toPandas()

,race,sum_capital_gain,avg_hours,min_education_num,max_age,avg_age,stddev_samp(capital_gain)
0,Other,399189.0,39.201970,1.0,77,33.657635,8650.182481
1,Amer-Indian-Eskimo,253319.0,40.272340,1.0,82,36.693617,2680.106448
2,Asian-Pac-Islander,2335108.0,39.884793,1.0,90,37.858460,10168.845627
3,Black,2755681.0,38.597866,1.0,90,37.914408,5000.937977

In [25]:
adult_whole_df.groupBy("race").count().show()

+------------------+-----+
|              race|count|
+------------------+-----+
|             Other|  406|
|Amer-Indian-Eskimo|  470|
|             White|41762|
|Asian-Pac-Islander| 1519|
|             Black| 4685|
+------------------+-----+

## Correlation Analysis

In [253]:
adult_whole_df.corr("age", "fnlwgt")

-0.07662807893178847

In [ ]:
for col in adult_whole_df.columns:
    adult_whole_df.corr()

## .when() & otherwise() 
It is similar to SQL Case When, executes sequence of expressions until it matches the condition and returns a value when match.
AND (&) OR(|) NOT(!)

In [26]:
adult_whole_df.select(adult_whole_df.sex, when(adult_whole_df.sex=="Male", 1) \
              .when(adult_whole_df.sex=="Female", 0) \
              .otherwise(adult_whole_df.sex).alias("new_gender") \
    ).show(10)

+------+----------+
|   sex|new_gender|
+------+----------+
|  Male|         1|
|  Male|         1|
|  Male|         1|
|  Male|         1|
|Female|         0|
|Female|         0|
|Female|         0|
|  Male|         1|
|Female|         0|
|  Male|         1|
+------+----------+
only showing top 10 rows

In [27]:
adult_whole_df = adult_whole_df \
.withColumn("education_merged",when(f.col("education") \
.isin("1st-4th","5th-6th","7th-8th"),"Elementary-School") \
.when(f.col("education").isin("9th","10th","11th", "12th"),"High-School") \
.when(f.col("education").isin("Masters","Doctorate"),"High-Education") \
.when(f.col("education").isin("Bachelors","Some-college"),"Under-Education") \
.otherwise(col("education")))
adult_whole_df.select("education_merged", "education").show(5)

+----------------+---------+
|education_merged|education|
+----------------+---------+
| Under-Education|Bachelors|
| Under-Education|Bachelors|
|         HS-grad|  HS-grad|
|     High-School|     11th|
| Under-Education|Bachelors|
+----------------+---------+
only showing top 5 rows

In [35]:
adult_whole_df = adult_whole_df.withColumn("marital_status_merged",
       when((col("marital_status") == "Separated") 
            | (col("marital_status") == "Widowed") 
            | (col("marital_status") == "Divorced") 
            | (col("marital_status") == "Never-married"), "Single")
      .otherwise("Married"))

adult_whole_df.select("marital_status_merged").show(5)

+---------------------+
|marital_status_merged|
+---------------------+
|               Single|
|              Married|
|               Single|
|              Married|
|              Married|
+---------------------+
only showing top 5 rows

In [32]:
adult_whole_df.groupBy("marital_status_merged").agg({"*":"count"}).show()

+---------------------+--------+
|marital_status_merged|count(1)|
+---------------------+--------+
|              Married|   23044|
|               Single|   25798|
+---------------------+--------+

## .drop()
To drop dataframe's columns

In [33]:
adult_whole_df = adult_whole_df.drop("education")

## .na.drop()
To drop null values

In [53]:
adult_whole_df = adult_whole_df.na.drop()

## withColumnRenamed()
Rename Column Name withColumnRenamed() funcsion

In [61]:
adult_whole_df = adult_whole_df.withColumnRenamed("sex", "gender") \
    .withColumnRenamed("output", "label")
adult_whole_df.limit(5).toPandas()

,age,workclass,fnlwgt,education_num,marital_status,occupation,relationship,race,gender,capital_gain,capital_loss,hours_per_week,native_country,label,education_merged,marital_status_merged
0,39,State-gov,77516.0,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K,Under-Education,Single
1,50,Self-emp-not-inc,83311.0,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K,Under-Education,Married
2,38,Private,215646.0,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K,HS-grad,Single
3,53,Private,234721.0,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K,High-School,Married
4,28,Private,338409.0,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K,Under-Education,Married

## .distinct()

In [67]:
adult_whole_df.select("race").distinct().count()

5

In [68]:
adult_whole_df.select("race").distinct().show()

+------------------+
|              race|
+------------------+
|             Other|
|Amer-Indian-Eskimo|
|             White|
|Asian-Pac-Islander|
|             Black|
+------------------+

## Detect Null Values
#### We need to write a function to look up the number of null values in the columns

In [197]:
def show_columns_which_have_null_values(dataframe): 
    index = 0
    for col in dataframe.columns:
        if dataframe.filter(f.col(col).isNull()).count() > 0:
            print(index, ".", col, " : There ara Null values")
        index += 1

In [191]:
show_columns_which_have_null_values(adult_whole_df) # we don't have columns with missing values

In [186]:
def get_null_values_as_pandas_dataframe(dataframe):
    data = dict()
    for sutun in adult_whole_df.columns:
        data.update({f"{sutun}" : adult_whole_df.filter(f.col(sutun).isNull()).count()})
    s1 = pd.Series(list(data.keys()))
    s2 = pd.Series(list(data.values()))
    df = pd.concat([s1, s2], axis=1)
    df = df.rename(columns={0:"Columns", 1:"Null_values"})
    return df

In [188]:
df = show_null_values_as_pandas_dataframe(adult_whole_df)
df

                  Columns  Null_values
0                     age            0
1               workclass            0
2                  fnlwgt            0
3           education_num            0
4          marital_status            0
5              occupation            0
6            relationship            0
7                    race            0
8                  gender            0
9            capital_gain            0
10           capital_loss            0
11         hours_per_week            0
12         native_country            0
13                  label            0
14       education_merged            0
15  marital_status_merged            0

## Aggregate Functions

In [233]:
#print("avg: " + str(adult_whole_df.select(avg("hours_per_week")).collect()[0][0]))
#print("count: "+str(adult_whole_df.select(count("hours_per_week")).collect()[0]))
#print(adult_whole_df.select(skewness("hours_per_week")).show())
#print(adult_whole_df.select(stddev("hours_per_week")).show())
#print(adult_whole_df.select(sum("hours_per_week")).show())
#print(adult_whole_df.select(max("hours_per_week")).show())
#print(adult_whole_df.select(min("hours_per_week")).show())
print(adult_whole_df.select(mean("hours_per_week")).show())

+-------------------+
|avg(hours_per_week)|
+-------------------+
| 40.422382375824085|
+-------------------+

None

## fillna() & fill()
DataFrame.fillna() or DataFrameNaFunctions.fill() is used to replace NULL/None values on all or selected multiple DataFrame columns with either zero(0), empty string, space, or any constant literal values.

In [ ]:
#Replace Replace 0 for null on only population column 
df.na.fill(value=0,subset=["population"]).show()

## sample()
PySpark sampling (pyspark.sql.DataFrame.sample()) is a mechanism to get random sample records from the dataset, this is helpful when you have a larger dataset and wanted to analyze/test a subset of the data for example 10% of the original file.

In [70]:
adult_random_sample_df = adult_whole_df.sample(fraction=0.2, seed=1234)
print("sample count : ",adult_random_sample_df.count())
print("original count : ", adult_whole_df.count())

sample count :  9867
original count :  48842